//=============================================================================
//
// ポリゴン処理 [bullet.h]
// Author : 
//
//=============================================================================
#ifndef _BULLET_H_
#define _BULLET_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// 影の構造体
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;					//ポジション
	D3DXVECTOR3 rot;					//移動
	D3DXMATRIX  mtxWorldWall;			//ワールドマトリックス
	bool		bUse;					//使用しているかどうか
	int			hIdxShadow;				//
	int         Life;					//弾の寿命
} BULLET;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);

void SetBullet(D3DXVECTOR3 pos,D3DXVECTOR3 rot);
BULLET *GetBullet(void);
#endif
