//=============================================================================
//
// 壁処理 [meshFwall.h]
// Author : 
//
//=============================================================================
#ifndef _MESHFWALL_H_
#define _MESHFWALL_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define POLTGON0_TEX "DATA/TEX/kabe.jpg"	//読み込むテクスチャファイル名
#define WIDTH		(24)
#define HEIGHT		(3)
#define SIZE_X		(150)
#define SIZE_Y		(800)
#define MAX_WALL	(16)

//=============================================================================
// 影の構造体
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;					//ポジション
	D3DXVECTOR3 rot;					//回転
	D3DXMATRIX mtxWorldWall;			//ワールドマトリックス
	bool		bUse;					//使用しているかどうか
} MESHWALL;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMeshWall(void);
void UninitMeshWall(void);
void UpdateMeshWall(void);
void DrawMeshWall(void);

int SetMeshWall(D3DXVECTOR3 pos, D3DXVECTOR3 rot);
MESHWALL *GetMeshWall(void);
#endif
