//-----------------------------------------------------------------------------
//
// ポーズ
//
//-----------------------------------------------------------------------------
#ifndef _PAUSE_H_
#define _PAUSE_H_

#define _CRT_SECURE_NO_WARNINGS

//-----------------------------------------------------------------------------
// インクルードファイル
//-----------------------------------------------------------------------------
#include	"main.h"	//インクルードファイル 

//----------------------------------------------------------------------------
//プロトタイプ宣言
//----------------------------------------------------------------------------
void InitPause(void);		//ポーズの初期化処理
void UninitPause(void);		//ポーズの終了処理
void UpdatePause(void);		//ポーズの更新処理
void DrawPause(void);		//ポーズの描画処理
void SetPause(D3DXVECTOR3 pos, D3DXCOLOR col, int nType, float fWidth, float fHeight);
#endif